import re

def remove_special_characters(text: str) -> str:
    characters = ['a', 'á', 'à', 'ả', 'ã', 'ạ',
                  'A', 'Á', 'À', 'Ả', 'Ã', 'Ạ',
                  'ă', 'ắ', 'ằ', 'ẳ', 'ẵ', 'ặ',
                  'Ă', 'Ắ', 'Ằ', 'Ẳ', 'Ẵ', 'Ặ',
                  'â', 'ấ', 'ầ', 'ẩ', 'ẫ', 'ậ',
                  'Â', 'Ấ', 'Ầ', 'Ẩ', 'Ẫ', 'Ậ',
                  'b', 'c', 'd', 'đ',
                  'B', 'C', 'D', 'Đ',
                  'e', 'é', 'è', 'ẻ', 'ẽ', 'ẹ',
                  'E', 'É', 'È', 'Ẻ', 'Ẽ', 'Ẹ',
                  'ê', 'ế', 'ề', 'ể', 'ễ', 'ệ',
                  'Ê', 'Ế', 'Ề', 'Ể', 'Ễ', 'Ệ',
                  'f', 'g', 'h', 
                  'F', 'G', 'H',
                  'i', 'í', 'ì', 'ỉ', 'ĩ', 'ị',
                  'I', 'Í', 'Ì', 'Ỉ', 'Ĩ', 'Ị',
                  'j', 'k', 'l', 'm', 'n',
                  'J', 'K', 'L', 'M', 'N',
                  'o', 'ó', 'ò', 'ỏ', 'õ', 'ọ',
                  'O', 'Ó', 'Ò', 'Ỏ', 'Õ', 'Ọ',
                  'ô', 'ố', 'ồ', 'ổ', 'ỗ', 'ộ',
                  'Ô', 'Ố', 'Ồ', 'Ổ', 'Ỗ', 'Ộ',
                  'ơ', 'ớ', 'ờ', 'ở', 'ỡ', 'ợ',
                  'Ơ', 'Ớ', 'Ờ', 'Ở', 'Ỡ', 'Ợ',
                  'p', 'q', 'r', 's', 't',
                  'P', 'Q', 'R', 'S', 'T',
                  'u', 'ú', 'ù', 'ủ', 'ũ', 'ụ',
                  'U', 'Ú', 'Ù', 'Ủ', 'Ũ', 'Ụ',
                  'ư', 'ứ', 'ừ', 'ử', 'ữ', 'ự',
                  'Ư', 'Ứ', 'Ừ', 'Ử', 'Ữ', 'Ự',
                  'v', 'w', 'x',
                  'V', 'W', 'X',
                  'y', 'ý', 'ỳ', 'ỷ', 'ỹ', 'ỵ',
                  'Y', 'Ý', 'Ỳ', 'Ỷ', 'Ỹ', 'Ỵ',
                  'z', 'Z',
                  ' ', ',', '.', '?', '!', ';',
                  '0', '1', '2', '3', '4', 
                  '5', '6', '7', '8', '9']

    pattern = f'[^{"".join(map(re.escape, characters))}]'
    text = re.sub(pattern, ' ', text, flags=re.IGNORECASE)
    text = re.sub(r'\s+', ' ', text)

    return text.strip()

def remove_non_letter_characters(text: str) -> str:
    characters = ['a', 'á', 'à', 'ả', 'ã', 'ạ',
                'A', 'Á', 'À', 'Ả', 'Ã', 'Ạ',
                'ă', 'ắ', 'ằ', 'ẳ', 'ẵ', 'ặ',
                'Ă', 'Ắ', 'Ằ', 'Ẳ', 'Ẵ', 'Ặ',
                'â', 'ấ', 'ầ', 'ẩ', 'ẫ', 'ậ',
                'Â', 'Ấ', 'Ầ', 'Ẩ', 'Ẫ', 'Ậ',
                'b', 'c', 'd', 'đ',
                'B', 'C', 'D', 'Đ',
                'e', 'é', 'è', 'ẻ', 'ẽ', 'ẹ',
                'E', 'É', 'È', 'Ẻ', 'Ẽ', 'Ẹ',
                'ê', 'ế', 'ề', 'ể', 'ễ', 'ệ',
                'Ê', 'Ế', 'Ề', 'Ể', 'Ễ', 'Ệ',
                'f', 'g', 'h', 
                'F', 'G', 'H',
                'i', 'í', 'ì', 'ỉ', 'ĩ', 'ị',
                'I', 'Í', 'Ì', 'Ỉ', 'Ĩ', 'Ị',
                'j', 'k', 'l', 'm', 'n',
                'J', 'K', 'L', 'M', 'N',
                'o', 'ó', 'ò', 'ỏ', 'õ', 'ọ',
                'O', 'Ó', 'Ò', 'Ỏ', 'Õ', 'Ọ',
                'ô', 'ố', 'ồ', 'ổ', 'ỗ', 'ộ',
                'Ô', 'Ố', 'Ồ', 'Ổ', 'Ỗ', 'Ộ',
                'ơ', 'ớ', 'ờ', 'ở', 'ỡ', 'ợ',
                'Ơ', 'Ớ', 'Ờ', 'Ở', 'Ỡ', 'Ợ',
                'p', 'q', 'r', 's', 't',
                'P', 'Q', 'R', 'S', 'T',
                'u', 'ú', 'ù', 'ủ', 'ũ', 'ụ',
                'U', 'Ú', 'Ù', 'Ủ', 'Ũ', 'Ụ',
                'ư', 'ứ', 'ừ', 'ử', 'ữ', 'ự',
                'Ư', 'Ứ', 'Ừ', 'Ử', 'Ữ', 'Ự',
                'v', 'w', 'x',
                'V', 'W', 'X',
                'y', 'ý', 'ỳ', 'ỷ', 'ỹ', 'ỵ',
                'Y', 'Ý', 'Ỳ', 'Ỷ', 'Ỹ', 'Ỵ',
                'z', 'Z', ' ']

    pattern = f'[^{"".join(map(re.escape, characters))}]'
    text = re.sub(pattern, ' ', text, flags=re.IGNORECASE)
    text = re.sub(r'\s+', ' ', text)

    return text.strip()